app/views/home/borrower_profile.html.erb

					<div class="accordion">
					   <% @field_partner = FieldPartner.find_borrower_field_partner(@borrower.field_partner_id) %>
---
SELECT `field_partners`.* FROM `field_partners` WHERE (`field_partners`.`field_partner_id` IS NULL) LIMIT 1

						<% end %>
						<% @community = Community.find(@borrower.community_id)%>
---
SELECT `communities`.* FROM `communities` WHERE (`communities`.`community_id` = 2) LIMIT 1

						<% unless @loan_repayments.blank? %>
						 <p>Period : <%= @loan_repayments.first.repayment_date.strftime("%b '%y") %> - <%= @loan_repayments.last.repayment_date.strftime("%b '%y") %></p>
---
SELECT `loan_repayments`.* FROM `loan_repayments` WHERE (`loan_repayments`.`loan_id` = 1)