app/views/home/index.html.erb

SELECT `loans`.* FROM `loans` WHERE (`loans`.`loan_id` = 1) LIMIT 1
---

			<% @loan = Loan.find(borrower.loan_id)%>