app/views/home/lend_money_to_borrower.html.erb

SELECT `categories`.* FROM `categories`
---
						<h3 class="left"><a href="<%= borrower_profile_path(:id=>@borrower.id,:name=>escape_url("#{@borrower.name}")) %>" title="<%= @loan.title.gsub("of their son","").gsub("of their daugther","") unless @loan.blank?%>"><%= @loan.title.gsub("of their son","").gsub("of their daugther","") unless @loan.blank?%></a></h3>
						<a href='<%= view_all_projects_path(:category=>"#{@category.name}") %>' class="left"><img src="/images/<%= @category.category_logo unless @category.category_logo.blank?%>" alt="<%= @category.name %>" title="<%= @category.name %>"/></a>