app/views/home/view_all_projects.html.erb

SELECT `borrowers`.* FROM `borrowers` WHERE (`borrowers`.`loan_id` = 11) LIMIT 1
SELECT `categories`.* FROM `categories` WHERE (`categories`.`category_id` = 3) LIMIT 1
---
				<% @loans.each do |loan|  %>
					<% @borrower = Borrower.find_loan_borrower(loan.id)%>
					<% @category =  Category.find(loan.category_id)%>

SELECT `categories`.* FROM `categories`
---
									<h3 class="left"><a href="<% if user_signed_in? %><%= borrower_profile_path(:id=>@borrower.id,:name=>escape_url("#{@borrower.name}")) %><% else %><%= new_user_session_url %> <% end %>" title="<%= loan.title.gsub("of their son","").gsub("of their daugther","") unless loan.blank? %>"><%= loan.title.gsub("of their son","").gsub("of their daugther","") unless loan.blank? %></a></h3>
									<a class="left" href='<%= view_all_projects_path(:category=>"#{@category.name}") %>'><img src="/images/<%= @category.category_logo unless @category.category_logo.blank?%>" alt="<%= @category.name %>" title="<%= @category.name %>" class="left"/></a>

SELECT `loans`.* FROM `loans` ORDER BY id desc
---
<script type="text/javascript">
$(document).ready(function() {

<% unless @loans.blank? %>
<% @loans.each do |loan|  %>


   $('.hover_change_<%= loan.id %>').hover(function() {
       var a= $(this).val

      if ($('#amount_paying_option_<%= loan.id %> option:selected').text() == "Choose your amount")
{
$('#graph_increase_<%= loan.id %>').css({width: '0%'} )
<% if $visiting_user_country == "India"%>
var amt_funded  =  Math.round(<%= (loan.amount - loan.loan_amount_remaining_in_rupees).round()%>)  ;
$('#amount_funded_<%= loan.id %>').text(amt_funded);
<% else %>
var amt_funded  =  Math.round(<%=  (loan.loan_amount_in_dollar - loan.amount_remaining).round() %>)  ;
$('#amount_funded_<%= loan.id %>').text(amt_funded);
<% end %>
}
else