app/controllers/borrower_controller.rb

  def create
    @borrower = Borrower.new(params[:borrower])
    @borrower.save!
---
INSERT INTO `borrowers` (`SHG`, `age`, `avg_monthly_income`, `borrower_group_id`, `borrower_story`, `community_id`, `country`, `created_at`, `credit_rating`, `date_disbursed`, `date_of_final_payment`, `district`, `education`, `field_partner_id`, `gender`, `home_image`, `impact_story_image`, `interest_rate`, `lender_id`, `loan_amount`, `loan_id`, `name`, `name_of_student`, `occupation`, `photo`, `poverty_level`, `profile_image`, `purpose`, `relationship_with_applicant`, `search_image`, `state`, `taluka`, `term`, `updated_at`, `village`) VALUES ('gfg', 0, NULL, NULL, '', NULL, 'fgf', '2010-11-19 10:57:23', NULL, NULL, NULL, '', NULL, NULL, '', '', NULL, NULL, NULL, 0.0, NULL, '', NULL, NULL, '', NULL, NULL, NULL, NULL, NULL, '', 'gfg', NULL, '2010-11-19 10:57:23', 'gf')