app/controllers/facebook_controller.rb

	def facebook_call
		url =  facebook_call_url
		client = facebook_client
		client.authorization.process_callback(params[:code], :redirect_uri => url)
		token = client.access_token
		fb_user = client.selection.me.info!
		Rails.logger.info "FB USER:"
		Rails.logger.info fb_user.inspect
		user = User.find_with_facebook_user(fb_user, token)
		if user.blank?
			user= User.create_with_facebook_user(fb_user, token)
			MilaapMailer.welcome_email(user).deliver
			find_geo_location
			user.user_country = $visiting_user_country
			user.save
---
SELECT `users`.* FROM `users` WHERE (`users`.`facebook_uid` = '100000816800978') LIMIT 1
UPDATE `users` SET `current_sign_in_at` = '2010-11-02 06:42:54', `current_sign_in_ip` = '127.0.0.1', `last_sign_in_at` = '2010-11-02 06:42:54', `last_sign_in_ip` = '127.0.0.1', `sign_in_count` = 1, `updated_at` = '2010-11-02 06:42:54' WHERE (`users`.`id` = 1)