app/controllers/fieldpartner_controller.rb

INSERT INTO `field_partners` (`community_id`, `created_at`, `credit_rating`, `deliquency_rate`, `field_partner_id`, `field_partner_type`, `info`, `information`, `lending_rate`, `logo`, `name`, `no_of_SHGS`, `no_of_districts_operating`, `no_of_poorest_districts`, `no_of_villages`, `percentage_of_women_borrowers`, `percentage_rural`, `rating_agency`, `repayment_rate`, `total_loan_portfolio`, `total_no_of_borrowers`, `updated_at`, `url`, `yrs_of_existance`) VALUES (NULL, '2010-11-18 08:11:10', NULL, NULL, NULL, '', '', '', NULL, '', '', '', NULL, NULL, '', NULL, NULL, '', NULL, '', NULL, '2010-11-18 08:11:10', '', NULL)
---
  def create
    @field_partner = FieldPartner.new(params[:fp])
    @field_partner.save!