app/controllers/google_outh_controller.rb

	def google_callback
		@access_token = $google_request_token.get_access_token({ :oauth_verifier => params[:oauth_verifier] ,:oauth_token => params[:oauth_token]})
		body = JSON.parse(@access_token.get("https://www.googleapis.com/userinfo/email?alt=json").body)
		user = User.first(:conditions=>{:email=>body["data"]["email"]})
		unless user.blank?
			sign_in(User,user)
			find_geo_location
			user.user_country = $visiting_user_country
			user.save
		  redirect_to welcome_url
		else
			# Sign in the user and redirect
			user = User.create(:email => body["data"]["email"])
---
SELECT `users`.`id` FROM `users` WHERE (LOWER(`users`.`email`) = LOWER('ask4prasath@gmail.com')) AND (`users`.id <> 1) LIMIT 1
UPDATE `users` SET `current_sign_in_at` = '2010-11-18 07:38:04', `sign_in_count` = 2, `updated_at` = '2010-11-18 07:38:04' WHERE (`users`.`id` = 1)
INSERT INTO `users` (`access_token`, `city`, `confirmed_at`, `country`, `created_at`, `current_sign_in_at`, `current_sign_in_ip`, `email`, `encrypted_password`, `facebook_bio`, `facebook_first_name`, `facebook_last_name`, `facebook_link`, `facebook_locale`, `facebook_location`, `facebook_name`, `facebook_token`, `facebook_uid`, `first_name`, `image_url`, `intro`, `invitation_flag`, `last_name`, `last_sign_in_at`, `last_sign_in_ip`, `loan_pledged`, `password_salt`, `remember_created_at`, `remember_token`, `reset_password_token`, `secret`, `sign_in_count`, `twitter_description`, `twitter_friends_count`, `twitter_lang`, `twitter_location`, `twitter_name`, `twitter_photo_url`, `twitter_profile_image_url`, `twitter_screen_name`, `twitter_time_zone`, `twitter_uid`, `twitter_url`, `updated_at`, `user_country`, `user_type`) VALUES (NULL, NULL, '2010-11-18 07:38:26', NULL, '2010-11-18 07:38:56', '2010-11-18 07:38:56', '127.0.0.1', 'prasath@milaap.org', '', NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, 0, NULL, '2010-11-18 07:38:56', '127.0.0.1', 0, '', NULL, NULL, NULL, NULL, 1, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, NULL, '2010-11-18 07:38:56', NULL, NULL)