app/controllers/home_controller.rb

 def borrower_profile
  find_geo_location
  @title= "MILAAP - Beyond Just Credit"
  @borrower = Borrower.find(params[:id])
  unless @borrower.blank?
    @loan = Loan.find(@borrower.loan_id)
    @loan_repayments = LoanRepayment.all(:conditions => {:loan_id =>@borrower.loan_id})
    @category = Category.find(@loan.category_id)
    @loan_lenders = LoanLender.all(:conditions => {:loan_id =>@loan.id})
---
SELECT `borrowers`.* FROM `borrowers` WHERE (`borrowers`.`borrower_id` IS NULL) LIMIT 1
SELECT `loans`.* FROM `loans` WHERE (`loans`.`loan_id` = 1) LIMIT 1
SELECT `loan_repayments`.* FROM `loan_repayments` WHERE (`loan_repayments`.`loan_id` = 1)
SELECT `categories`.* FROM `categories` WHERE (`categories`.`category_id` = 5) LIMIT 1
SELECT `loan_lenders`.* FROM `loan_lenders` WHERE (`loan_lenders`.`loan_id` = 1)

	def view_all_projects
		session[:tab] = "pledge"
		find_geo_location
		@categories = Category.all
		if params[:category]
			@catgry =  Category.first(:conditions => {:name =>params[:category]})
			unless @catgry.blank?
				@loans = Loan.all(:conditions => {:category_id =>@catgry.category_id}).order_by([:loan_id,:desc])
				@loans = @loans.paginate :page => params[:page], :per_page =>5
				if  @loans.blank?
          flash[:notice] ="We are working on getting loans for the cause that you want to support. It will take us some time. In the meanwhile, you can take a look at other causes and support them."
					@loans = Loan.all.order_by([:loan_id,:desc])
				  @loans = @loans.paginate :page => params[:page], :per_page =>5
				end
			else
				@title= "MILAAP - Beyond Just Credit"
				@loans = Loan.all.order_by([:loan_id,:desc])
				@loans = @loans.paginate :page => params[:page], :per_page =>5
			end
		else
			@title= "MILAAP - Beyond Just Credit"
			@loans = Loan.find(:all, :order => "id desc")
---
SELECT `categories`.* FROM `categories` WHERE (`categories`.`category_id` = 3) LIMIT 1
SELECT `categories`.* FROM `categories` WHERE (`categories`.`name` = 'HEALTH') LIMIT 1
SELECT `loans`.* FROM `loans` ORDER BY loan_id, desc
SELECT `categories`.* FROM `categories` WHERE (`categories`.`id` = 3) LIMIT 1

	def lend_money_to_borrower
		 session[:tab] = "pledge"
		 session[:email] = current_user.email
		find_geo_location

		@categories = Category.all
		#begin
			if request.post?
				p "***************"
				p params[:id]
				session[:email] = current_user.email
				session[:id] = params[:id]
    		session[:borrower_id] = params[:borrower_id]
				session[:loan_id] = params[:loan_id]
				session[:amount] = params[:amount_1]
				@borrower = Borrower.first(:conditions => {:id => params[:id]})
			  @loan = Loan.first(:conditions => {:id =>@borrower.loan_id})
---
SELECT `categories`.* FROM `categories`
SELECT `loans`.* FROM `loans` WHERE (`loans`.`loan_id` IS NULL) LIMIT 1